Element cannot be mirrored or rotated in a manner that changes its angle relative to the ground.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoRotateMirrorZ { get; }
  Visual Basic
Public Shared ReadOnly Property NoRotateMirrorZ As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoRotateMirrorZ {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace